Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: ཉན་ཐོས་རྣམས་ཀྱི་རྣམ་པར་གྲོལ་བ་ནི་སྒྲའི་རྗེས་སུ་འགྲོ་བའོ། །
en: The liberation of śrāvakas conforms to words.

source: རང་སངས་རྒྱས་རྣམས་ཀྱི་རྣམ་པར་གྲོལ་བ་ནི་རྐྱེན་ཁོང་དུ་ཆུད་པའོ། །
en: The liberation of pratyekabuddhas consists of their comprehension of conditions.

source: སངས་རྒྱས་རྣམས་ཀྱི་རྣམ་པར་གྲོལ་བ་ནི་ཆགས་པ་དང་། འཛིན་པ་ཐམས་ཅད་དང་བྲལ་བས་རྣམ་པར་གྲོལ་བ་ཞེས་བྱ་སྟེ།
en: The liberation of buddhas is called liberation because it is free of all attachment and apprehending.

source: སྔོན་གྱི་མཐར་ཡང་མ་བཅིངས། ཕྱི་མའི་མཐར་ཡང་མི་འཕོ། ད་ལྟར་བྱུང་བ་ལ་ཡང་མི་གནས་སོ། །
en: They are not tied to the past, they are not projected into the future, and they do not abide in the present.

source: མིག་དང་གཟུགས་ལ་གཉིས་སུ་འཛིན་པ་ལས་རྣམ་པར་གྲོལ་བའོ། །རྣ་བ་དང་། སྒྲ་དང་། སྣ་དང་། དྲི་དང་། ལྕེ་དང་། རོ་དང་། ལུས་དང་། རེག་བྱ་དང་། ཡིད་དང་། ཆོས་ལ་གཉིས་སུ་འཛིན་པ་ལས་རྣམ་པར་གྲོལ་བ་སྟེ།
en: They are free from apprehending the eye and form as two, and from apprehending the ear and sound, the nose and smell, the tongue and taste, the body and tactile objects, and the mind and mental factors as two.

source: འཛིན་པར་མངོན་པར་ཞེན་པའི་གནས་ལས་རྣམ་པར་གྲོལ་བའོ། །
en: They are free from apprehending and grasping.

source: སེམས་རང་བཞིན་འོད་གསལ་བ་དེ་བཞིན་དུ་ཤེས་པ་སྟེ།
en: Likewise, they know the luminous nature of the mind.

source: དེའི་ཕྱིར་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཞེས་བྱའོ། །
en: Therefore, they are called complete and perfect buddhas who have gained unsurpassed complete and perfect awakening through a single mental moment of insight.

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་གཞན་དག་དང་། གང་ཟག་གཞན་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: “Just as the tathāgatas have attained complete and perfect buddhahood, so they teach the Dharma to other beings and individuals.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་ཉི་ཤུ་རྩ་དྲུག་པའོ། །
en: This is the twenty-sixth tathāgata activity of the tathāgatas.

source: ཉན་ཐོས་རྣམས་ཀྱི་རྣམ་གྲོལ་སྒྲ་རྗེས་འགྲོ། །
en: “ ‘The liberation of śrāvakas conforms to words.

source: རང་སངས་རྒྱས་ཀྱི་བརྟེན་ནས་སྐྱེས་པའོ། །
en: That of pratyekabuddhas concerns dependent arising.

source: སངས་རྒྱས་མ་སྨད་རྣམས་ཀྱི་རྣམ་གྲོལ་ནི། །
en: The liberation of the irreproachable buddhas

source: ཆགས་ལས་རབ་འདས་དྲི་མེད་ནམ་མཁའ་འདྲ། །
en: Transcends attachment and is immaculate like space.

source: སེམས་ནི་སྔོན་ནས་བཅིངས་པར་མ་གྱུར་ཏེ། །
en: “ ‘Their minds were not bound in the past;

source: སེམས་རྒྱུན་འདི་དག་རང་བཞིན་རྣམ་པར་གྲོལ། །
en: Their mindstreams are naturally free.

source: ཇི་ལྟར་རྣམ་གྲོལ་དེ་ལྟར་ཡང་དག་ཤེས། །
en: Just as they are free, they know.

source: ཤེས་ནས་རྣམ་གྲོལ་ཉམས་པ་གང་ཡང་མེད། །
en: Knowing, their liberation never deteriorates.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་ལུས་ཀྱི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བའོ། །
en: (27) “Son of noble family, all physical activities of the tathāgatas are preceded and accompanied by wisdom.

source: དེ་བཞིན་གཤེགས་པ་ལུས་ཀྱི་ལས་དེ་དང་ལྡན་པས་ལྟ་བས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ། སྨྲ་བས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ། ཅང་མི་སྨྲ་བས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ། ཟ་བས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ།
en: They tame sentient beings while they gaze, speak, remain silent, or eat.

source: སྤྱོད་ལམ་གྱིས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ།
en: They tame them through their conduct.

source: མཚན་དག་གིས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ། དཔེ་བྱད་བཟང་པོ་དག་གིས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ། སྤྱི་གཙུག་བལྟར་མི་སྣང་བས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ།
en: They tame beings by means of their major marks and minor signs and by means of their invisible crown protuberance.

source: བལྟས་པ་ཙམ་གྱིས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ། འོད་གཏོང་བས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ།
en: They tame beings merely by their gaze and by emitting light.

source: གོམ་པ་འདོར་བས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ། གྲོང་ཁྱེར་དུ་འཇུག་པ་དང་འབྱུང་བས་ཀྱང་སེམས་ཅན་རྣམས་འདུལ་ཏེ།
en: They tame them as they walk about and while arriving at or departing from cities.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྤྱོད་ལམ་གང་སེམས་ཅན་འདུལ་བར་མི་འགྱུར་བ་དེ་གང་ཡང་མེད་དོ། །
en: There is no manner of conduct of the blessed buddhas that does not tame sentient beings.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་ལུས་ཀྱི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་ཞེས་བྱའོ། །
en: That is why all physical activities of the tathāgatas are said to be preceded and accompanied by wisdom.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་ཉི་ཤུ་རྩ་བདུན་པའོ། །
en: This is the twenty-seventh tathāgata activity of the tathāgatas.

source: འདྲེན་པ་རྣམས་ཀྱི་སྤྱོད་ལམ་སྟོན་པ་དང་། །འགྲོ་དང་འཇུག་དང་དེ་བཞིན་འབྱུང་བ་དང་། །དཔེ་བྱད་བཟང་དང་མཚན་དང་སྤྱི་གཙུག་གིས། །སངས་རྒྱས་དག་ནི་སེམས་ཅན་འདུལ་བར་སྦྱོར། །
en: “ ‘The buddhas apply themselves to taming beings By displaying their conduct as guides As they walk about, arrive, and depart And by means of their major marks, minor signs, and crown protuberance.

source: རྣམ་པར་འདྲེན་པ་གང་ཚེ་འོད་གཏོང་བ། །
en: “ ‘The moment the guides emit their light,

source: དེ་ཚེ་སྐྱེ་བོ་དུ་མ་བདེ་བར་གྱུར། །
en: Many beings experience bliss.

source: འོད་ཀྱིས་རེག་ནས་འདུལ་བར་རབ་ཏུ་འགྲོ། །
en: Touched by the light, they are tamed.

source: འདི་ནི་རྐང་གཉིས་དམ་པ་རྣམས་ཀྱི་ལས། །
en: This is the activity of venerable beings.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་ངག་གི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བའོ། །
en: (28) “Son of noble family, all verbal activities of the tathāgatas are preceded and accompanied by wisdom.

source: དེ་བཞིན་གཤེགས་པ་ནི་འབྲས་བུ་ཡོད་པའི་ཆོས་སྟོན་པའོ། །ཕྱད་པར་ལུང་སྟོན་པའོ། །ཤིན་ཏུ་ངེས་པའི་ཚིག་སྨྲ་བའོ། །
en: The tathāgatas teach dharmas that give results, they communicate continuously, and the words they articulate are clearly defined.

source: དེ་བཞིན་གཤེགས་པའི་ངག་དེ་ཡང་ཀུན་ཤེས་པར་བྱེད་པའོ། །
en: The speech of the tathāgatas makes everything known.

source: རྣམ་པར་ཤེས་པར་བྱེད་པའོ། །
en: It generates cognition.

source: མི་མཐོ་བའོ། །མི་དམའ་བའོ། །
en: It is neither lofty nor sordid.

source: མ་ཡོ་བའོ། །ལྡབ་ལྡིབ་ཅན་མ་ཡིན་པའོ། །གྱ་གྱུ་མ་ཡིན་པའོ། །
en: It is not crooked, unclear, or dishonest.

source: མི་བརླང་བའོ། །མི་རྩུབ་པའོ། །མ་འཆལ་བའོ། །
en: It is not rough, harsh, or distorted.

source: འཇམ་པའོ། །མཉན་པའོ། །ལས་སུ་རུང་བའོ། །
en: It is soft, pleasing, and flexible.

source: ར་ར་པོ་མ་ཡིན་པའོ། །བྱུང་རྒྱལ་མ་ཡིན་པའོ། །བརྟབས་པ་མ་ཡིན་པའོ། །རྣམ་པར་མྱུར་བ་མ་ཡིན་པའོ། །རབ་ཏུ་མྱུར་བ་མ་ཡིན་པའོ། །
en: It is not inane or prattling, nor is it frantic, hasty, or hurried.

source: ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བའོ། །ཤིན་ཏུ་ངེས་པའི་ཚིག་གོ། །
en: It is distinct, and the words are clearly defined.

source: ཤིན་ཏུ་དགའ་བ་སྐྱེད་པའོ། །ཤིན་ཏུ་གདངས་སྙན་པའོ། །ཤིན་ཏུ་གསལ་བའོ། །
en: It is joyous, melodious, and lucid.

source: ཐགས་ཐོགས་མེད་པའོ། །རྫོགས་པའོ། །སྙན་པའོ། །
en: It is unimpeded, perfect, and pleasant.

source: འབྲེལ་བའོ། །བསྒྲགས་པའོ། །མཆོད་པར་གྱུར་པའོ། །མཛེས་པའོ། །
en: It is relevant, renowned, honorable, and beautiful.

source: རྡུལ་མེད་པའོ། །རྡུལ་དང་བྲལ་བའོ། །ཐ་བ་མེད་པའོ། །
en: It is flawless, impeccable, and pliant.

source: དྲི་མ་མེད་པའོ། །དྲི་མ་དང་བྲལ་བའོ། །རྨོངས་པ་མེད་པའོ། །
en: It is stainless, immaculate, and unambiguous.

source: ཤིན་ཏུ་ཟུར་ཕྱིན་པའོ། །ཆགས་པ་མེད་པའོ། །རབ་ཏུ་གྲོལ་བའོ། །
en: It is intelligible, unimpeded, and liberating.

source: འོད་གསལ་བའོ། །དྲང་བའོ། །
en: It is illuminating and straightforward.

source: མི་དམན་པའོ། །མ་འཛིངས་པའོ། །དིབ་དིབ་པོ་མ་ཡིན་པའོ། །
en: It is not inferior, disordered, or stammering.

source: བདེ་བ་སྐྱེད་པའོ། །ལུས་ཚིམ་པར་བྱེད་པའོ། །སེམས་དགའ་བ་སྐྱེད་པའོ། །
en: It generates bliss, physical well being, and mental delight.

source: འདོད་ཆགས་ཞི་བར་བྱེད་པའོ། །ཞེ་སྡང་འདུལ་བའོ། །གཏི་མུག་སེལ་བའོ། །
en: It pacifies attachment, subdues aversion, and dispels delusion.

source: བདུད་འཇོམས་པའོ། །སྡིག་པ་སེལ་བའོ། །རྒོལ་བ་འདུལ་བའོ། །
en: It overcomes demons, eliminates evil, and subjugates opponents.

source: རྔའི་སྒྲའོ། །
en: It sounds like a drum.

source: མཁས་པ་དགའ་བར་བྱེད་པའོ། །
en: It delights the wise.

source: ཀ་ལ་པིང་ཀའི་སྒྲ་དབྱངས་སོ། །བརྒྱ་བྱིན་གྱི་སྒྲའོ། །ཚངས་པའི་སྒྲའོ། །
en: It sings like a kalaviṅka bird, Śakra, and Brahmā.

source: རྒྱ་མཚོའི་རླབས་ཀྱི་སྒྲའོ། །སྤྲིན་གྱི་སྒྲའོ། །
en: It sounds like ocean waves and thunder.

source: སའི་སྒྲ་དབྱངས་སོ། །
en: It resonates like the earth.

source: ཁྲུང་ཁྲུང་གི་སྒྲའོ། །རྨ་བྱའི་སྒྲ་སྐད་དོ། །ཁུ་བྱུག་གི་སྒྲའོ། །
en: It sounds like a crane, like the calls of a peacock and a cuckoo.

source: ཤང་ཤང་ཏེའུའི་སྒྲའོ། །ངང་པའི་རྒྱལ་པོའི་སྒྲའོ། །རི་དགས་ཀྱི་རྒྱལ་པོའི་སྒྲའོ། །
en: It sounds like the jīvañjīvaka bird, like the king of geese, and like the king of beasts.

source: པི་བང་དང་། པི་བང་རྒྱུད་གསུམ་པ་དང་། ཁར་རྔ་དང་།
en: It sounds like a vīṇā, the three-stringed vīṇā, and drums.

source: གླིང་བུ་དང་། དུང་དང་། སིལ་སྙན་གྱི་སྒྲའོ། །
en: It sounds like a flute, a conch, and cymbals.

source: ཀུན་ཤེས་པར་བྱ་བའོ། །རྣམ་པར་ཤེས་པར་བྱ་བའོ། །གསལ་བའོ། །
en: It is informative, instructive, and lucid.

source: ཡིད་དུ་འོང་བའོ། །མཉན་པར་འོས་པའོ། །ཟབ་པའོ། །
en: It is charming, worth listening to, and profound.

source: བརྫུན་པ་མ་ཡིན་པའོ། །
en: It is not false.

source: རྣ་བ་བདེ་བར་བྱེད་པའོ། །དགེ་བའི་རྩ་བ་སྐྱེད་པའོ། །
en: It is melodious and generates roots of virtue.

source: ཚིག་དང་ཡི་གེ་ཉམས་པ་མེད་པའོ། །ཚིག་དང་ཡི་གེ་ཤིན་ཏུ་ངེས་པའི་ཚིག་གོ། །
en: Its words and expressions are not degenerate but clearly defined.

source: དོན་དང་ལྡན་པའོ། །ཆོས་དང་ལྡན་པའོ། །
en: It is meaningful and endowed with Dharma.

source: དུས་དང་ལྡན་པའོ། །དུས་ཚིགས་ཐམས་ཅད་དང་ལྡན་པའོ། །དུས་ལས་མི་གཡོ་བའོ། །
en: It is timely, always relevant, and appropriate.

source: དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པ་སྟོན་པའོ། །
en: “The tathāgatas teach while knowing whose faculties are excellent and whose are not.

source: སྦྱིན་པས་བརྒྱན་པའོ། །ཚུལ་ཁྲིམས་ཀྱིས་རྣམ་པར་དག་པའོ། །བཟོད་པས་ཡང་དག་པར་བསྒྲུབས་པའོ། །བརྩོན་འགྲུས་ཀྱིས་ཤིན་ཏུ་སྦྱངས་པའོ། །བསམ་གཏན་གྱིས་ལས་སུ་རུང་བར་བྱས་པའོ། །ཤེས་རབ་ཀྱིས་ངེས་པར་བཏགས་པའོ། །
en: Their speech is embellished by generosity, purified by moral conduct, correctly accomplished through patience, made pliant through vigor, made flexible through concentration, and investigated with insight.

source: བྱམས་པས་ཤིན་ཏུ་བརྩམས་པའོ། །སྙིང་རྗེས་སྐྱོ་བ་མེད་པའོ། །
en: It is taken up with love and undiscouraged because of compassion.

source: རབ་ཏུ་དགའ་བའོ། །འོད་གསལ་བའོ། །
en: It is joyful and radiant.

source: བཏང་སྙོམས་ཀྱིས་ངེས་པར་བརྟག་པའོ། །
en: It discerns with equanimity.

source: ཐེག་པ་གསུམ་རྣམ་པར་འཇོག་པའོ། །
en: It establishes the three vehicles.

source: དཀོན་མཆོག་གསུམ་གྱི་རིགས་རྒྱུན་མི་གཅོད་པའོ། །
en: It is the unbroken lineage of the Three Jewels.

source: ཕུང་པོ་གསུམ་རྣམ་པར་འབྱེད་པའོ། །
en: It differentiates the three groups.

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་གྱིས་རྣམ་པར་སྦྱངས་པའོ། །
en: It trains through the three gates of liberation.

source: བདེན་པས་ཡོངས་སུ་བསྒོས་པའོ། །ཡེ་ཤེས་ཀྱིས་ཡོངས་སུ་བསྒོས་པའོ། །
en: It is entirely suffused by the truth and wisdom.

source: མཁས་པས་མ་སྨད་པའོ། །འཕགས་པས་བསྔགས་པའོ། །
en: It is not criticized by the wise but praised by the noble ones.

source: ནམ་མཁའི་ཚད་ཀྱི་རྗེས་སུ་འགྲོ་བའོ། །རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའོ། །
en: It reaches to the limits of space and is supreme in all respects.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པའི་ངག་ནི་དེ་ལྟ་བུ་སྟེ།
en: Son of noble family, the speech of the tathāgatas is like that.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་ངག་གི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་ཞེས་བྱའོ། །
en: That is why all verbal activities of the tathāgatas are said to be preceded and accompanied by wisdom.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་ཉི་ཤུ་རྩ་བརྒྱད་པའོ། །
en: This is the twenty-eighth tathāgata activity of the tathāgatas.

source: མཚུངས་པ་མེད་པའི་ངག་ནི་གསལ་ཞིང་དྲི་མེད་ཡོན་ཏན་ཀུན་གྱིས་འཕགས། །
en: “ ‘Their incomparable speech is lucid and stainless with all its splendid qualities.

source: ཞིང་སྟོང་རྒྱས་པར་འགེངས་ཤིང་སྐད་ཅིག་ལས་ཀྱང་སྐད་རྣམས་ཀུན་གྲག་སྟེ། །
en: It radiates throughout a thousand fields, and from a single act of speech many discourses resound.

source: སེམས་ཅན་ཁ་ཅིག་ཉན་ཐོས་ཐེག་དང་དེ་བཞིན་རང་རྒྱལ་ཐེག་པ་ཐོས། །
en: Some people hear the Śrāvaka Vehicle and others the Pratyekabuddha Vehicle.

source: ཐོས་ནས་སངས་རྒྱས་བདག་ཉིད་ཆེན་པོས་དེ་བཞིན་བྱང་ཆུབ་འདིར་ཡིད་འཛུད། །
en: According to what they have heard, the buddhas, the great beings, Guide their minds toward the corresponding awakening.

source: ཡི་གེ་རྣམས་ནི་མཚམས་སྦྱོར་མ་ཡིན་ཕན་ཚུན་འགལ་བར་འགྱུར་བའང་མིན། །
en: “ ‘Their terminology is neither disjointed nor contradictory.

source: དེ་ལྟར་ཆོས་རབ་སྟོན་ཀྱང་སེམས་ནི་རྣམ་པར་རྟོག་པར་འགྱུར་བ་མེད། །
en: They teach the Dharma without any concepts in their minds.

source: ཇི་ལྟར་བྲག་ཅ་གཡོ་བ་མེད་ཅིང་བྱེད་པ་མེད་པར་སྒྲ་སྒྲོག་པ། །
en: Like an echo, which resounds exactly and effortlessly,

source: དེ་ལྟར་མི་ཡི་དམ་པ་སྒྲ་རྣམས་སྒྲོག་ཅིང་སེམས་ཅན་ཚིམ་པར་བྱེད། །
en: The speech of noble beings resonates and satisfies ordinary beings.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་ཡིད་ཀྱི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བའོ། །
en: (29) “Son of noble family, furthermore, the entire range of the tathāgatas’ mental activity is preceded and accompanied by wisdom.

source: དེ་བཞིན་གཤེགས་པ་ནི་སེམས་ཀྱིས་བརྗོད་པར་བྱ་བ་མ་ཡིན། ཡིད་ཀྱིས་མ་ཡིན། རྣམ་པར་ཤེས་པས་མ་ཡིན་གྱི་དེ་བཞིན་གཤེགས་པ་ནི་
en: The tathāgatas are inexpressible in terms of mind, mental activity, or consciousness.

source: ཡེ་ཤེས་ཀྱིས་རབ་ཏུ་ཕྱེ་བ་སྟེ།
en: They are distinguished by wisdom.

source: ཡེ་ཤེས་ཀྱི་བདག་པོར་གྱུར་པའོ། །
en: They are the sovereigns of wisdom.

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྗེས་སུ་སོང་བའོ། །
en: The wisdom of the tathāgatas conforms with the minds of all sentient beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་ཀྱི་རྗེས་སུ་ཞུགས་པའོ། །
en: It engages with the mental activity of all sentient beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཤེས་པ་རིག་པའོ། །
en: It knows the consciousness of all sentient beings.

source: ཆོས་ཐམས་ཅད་ངེས་པར་བསམས་པའོ། །
en: It has resolved all phenomena.

source: ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པའོ། །
en: In all its absorptions, it does not depend on anything else.

source: དམིགས་པ་ལས་ཤིན་ཏུ་འདས་པའོ། །
en: It completely transcends objectification.

source: རྐྱེན་ལས་སྐྱེ་བ་དང་བྲལ་བའོ། །
en: It is free from conditioned arising.

source: སྲིད་པ་གསུམ་བསལ་བའོ། །
en: It has eliminated the three existences.

source: ང་རྒྱལ་གྱི་རིམ་པ་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདས་པའོ། །
en: It has completely transcended any degree of pride.

source: བདུད་ཀྱི་ལས་ཐམས་ཅད་ལས་རྣམ་པར་གྲོལ་བའོ། །
en: It is free of all the works of Māra.

source: སྒྱུ་དང་གཡོ་ཐམས་ཅད་དང་བྲལ་བའོ། །
en: It is not constrained by any deception or pretense.

source: ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་སྤངས་པའོ། །
en: It has eschewed clinging to I and mine.

source: མ་རིག་པ་དང་གཏི་མུག་གི་མུན་པ་དང་རབ་རིབ་ཀྱི་ལིང་ཏོག་དང་བྲལ་བའོ། །
en: It is free of the faulty vision and darkness of ignorance and delusion.

source: ལམ་གྱི་ཡན་ལག་ཤིན་ཏུ་ཡོངས་སུ་བསྒོམས་པའོ། །
en: It has completely cultivated the branches of the path.

source: ནམ་མཁའ་ལྟར་རྣམ་པར་མི་རྟོག་པའོ། །
en: It is nonconceptual like space.

source: ཆོས་ཀྱི་དབྱིངས་དང་དབྱེར་མེད་པ་སྟེ།
en: It is inseparable from the realm of phenomena.

source: དེ་བཞིན་གཤེགས་པའི་ཡིད་ཀྱི་ལས་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བ་ནི་དེ་ལྟ་བུའོ། །
en: This is how the tathāgatas’ mental activity is preceded and accompanied by wisdom.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་ཉི་ཤུ་རྩ་དགུ་པའོ། །
en: This is the twenty-ninth tathāgata activity of the tathāgatas.

source: རྒྱལ་བ་རྐང་གཉིས་དབང་པོ་སེམས་དང་ཡིད་ཀྱིས་གཞལ་མ་ཡིན། །
en: “ ‘The victorious lords of humans cannot be fathomed by mind or thought.

source: ཡེ་ཤེས་རྣམ་པར་དག་གིས་འདྲེན་པ་ཀུན་གྱི་ལས་རྣམས་དག །
en: Pure wisdom purifies the acts of all the guides.

source: བདེ་གཤེགས་ཡེ་ཤེས་དེ་ནི་སེམས་ཅན་ཀུན་གྱི་བསམ་པ་ལ། །
en: Sugata wisdom engages equally with the thoughts of all beings,

source: མཉམ་པ་ཉིད་དུ་རྗེས་སུ་ཞུགས་ཤིང་ཆོས་དབྱིངས་རང་བཞིན་ནོ། །
en: While being by nature the realm of phenomena.

source: བསམ་གཏན་དང་ནི་དེ་བཞིན་ཏིང་འཛིན་ཀུན་དང་རབ་ཏུ་ལྡན། །
en: “ ‘It is endowed with all types of concentrations and absorptions.

source: སེམས་དང་ཡིད་ཀྱི་རྣམ་པར་རྟོག་པ་ཀུན་དུ་རྒྱུ་བ་མེད། །
en: It is not stirred by any conceptuality of mind or mental activity.

source: བདུད་ཀྱི་ཡུལ་ལས་གྲོལ་ཞིང་བདུད་ཀྱི་ལས་ལས་ཤིན་ཏུ་འདས། །
en: It is free from Māra’s domain and transcends all of Māra’s works.

source: ནམ་མཁའི་རང་བཞིན་མཚུངས་ཤིང་དྲི་མེད་རྣམ་པར་འགྱུར་བ་མེད། །
en: It uniform, immaculate, and changeless, having the nature of space.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་འདས་པའི་དུས་ལ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་མཐོང་བ་ཆགས་པ་མེད་ཅིང་ཐོགས་པ་མེད་པར་འཇུག་གོ། །
en: (30) “Son of noble family, the tathāgatas’ vision of wisdom has unattached and unobstructed access to the past.

source: ཇི་ལྟར་འཇུག་ཅེ་ན།
en: How is that?

source: འདས་པའི་དུས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་བྱུང་བ་དང་ཞིག་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་བགྲང་བའི་ཚུལ་གྱིས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know numerically the entire range of buddhafields that have appeared and disappeared in the past.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ནགས་ཚལ་དུ་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know each and every blade of grass, each bush, herb, and forest in those buddhafields.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་སེམས་ཅན་གྱི་ཚོགས་སེམས་ཅན་དུ་བཏགས་པར་གྱུར་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know each and every gathering of creatures designated as beings in those buddhafields.

source: སེམས་ཅན་དེ་དག་གི་སྤྱོད་པ་སྣ་ཚོགས་སུ་གྱུར་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know each and every type of conduct of those beings.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཏུ་སངས་རྒྱས་བྱུང་བ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know each and every buddha that has emerged in those buddhafields.

source: སངས་རྒྱས་རེ་རེས་ཆོས་བསྟན་ཅིང་བརྗོད་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know each and every dharma taught and expressed by each buddha.

source: སེམས་ཅན་ཇི་སྙེད་ཅིག་ཉན་ཐོས་ཀྱི་ཐེག་པར་བཏུལ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །སེམས་ཅན་ཇི་སྙེད་ཅིག་རང་སངས་རྒྱས་ཀྱི་ཐེག་པར་བཏུལ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །སེམས་ཅན་ཇི་སྙེད་ཅིག་ཐེག་པ་ཆེན་པོར་བཏུལ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know each and every being tamed in the Śrāvaka Vehicle and the Pratyekabuddha Vehicle, as well as those tamed in the Great Vehicle.

source: སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་ཕྱེ་བ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །དགེ་སློང་གི་དགེ་འདུན་རྣམ་པར་ཕྱེ་བ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །ཚེའི་ཚད་རྣམ་པར་ཕྱེ་བ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །ཆོས་གནས་པ་རྣམ་པར་ཕྱེ་བ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know all the distinguishing features of the buddhafields, the different monastic congregations, and the range of lifespans, as well as the different categories of Dharma.

source: དབུགས་འབྱུང་བ་དང་རྔུབ་པ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། །ཟས་ཀྱི་མཆོག་གི་ལོངས་སྤྱོད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know of each inhalation and exhalation and of the enjoyment of excellent food.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདས་པའི་རྣམ་པ་དང་། འཆི་འཕོ་དང་། འགྲོ་བར་སྐྱེ་བ་རྣམས་ཀྱང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “The tathāgatas know the forms of all past beings, their deaths, and their rebirths.

source: དབང་པོ་སྣ་ཚོགས་དང་སྤྱོད་པ་སྣ་ཚོགས་དང་། བསམ་པ་སྣ་ཚོགས་རྣམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །སེམས་ཀྱི་རྒྱུད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know their various faculties, activities, and mentalities. They know their mindstreams.

source: སེམས་གང་གི་འོག་ཏུ་སེམས་གང་བྱུང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པས་མངོན་སུམ་གྱི་ཤེས་པ་དང་རྗེས་སུ་རྟོགས་པའི་ཤེས་པས་བགྲང་བའི་ཚུལ་གྱིས་རབ་ཏུ་མཁྱེན་ཏེ།
en: They know numerically each and every mental state that has arisen based on a previous mental state, both through direct and indirect cognition.

source: དེ་དང་དེ་བཞིན་གཤེགས་པའི་སེམས་ཀྱི་རྒྱུད་འདས་པ་བཏང་བ་རྣམས་ཀྱང་དམིགས་སོ། །
en: They also observe the past mindstreams of previous tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་ནི་ཡེ་ཤེས་དེ་ལྟ་བུ་དང་ལྡན་པས་སེམས་ཅན་རྣམས་ལ་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཕྱད་པར་ཆོས་སྟོན་ཏེ།
en: With such wisdom, the tathāgatas teach the Dharma to beings continuously in accordance with their ways of thinking.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་སུམ་ཅུ་པའོ། །
en: This is the thirtieth tathāgata activity of the tathāgatas.

source: ཞིང་དང་སེམས་ཅན་དང་ནི་ཆོས་སྨྲ་ལ། །སངས་རྒྱས་ཡེ་ཤེས་ཆགས་མེད་ཚད་ཀྱང་མེད། །
en: “ ‘With regard to the fields, beings, and Dharma taught, Buddha wisdom is unattached and immeasurable.

source: འདྲེན་པས་སེམས་ཅན་གང་དག་ཐར་བྱས་དང་། །
en: The number of beings liberated by the guides

source: ཞིང་དུ་དགེ་སློང་དགེ་འདུན་གྱུར་གྲངས་དང་། །
en: And the number of monastic congregations in the fields,

source: སེམས་ཅན་བསམ་པ་དབང་པོ་གང་ཡིན་དང་། །
en: “ ‘The thoughts and faculties of beings,

source: དབྱིབས་དང་སྒྲ་ཡི་རིམ་པ་གང་དང་སེམས། །
en: Their grades of physical form, speech, and mind,

source: མིང་དང་སྦྱོར་བ་གང་དག་འདས་པ་ཀུན། །
en: Their names and behavior and all past events—

source: རྫོགས་པའི་སངས་རྒྱས་ཡང་དག་གཟིགས་པས་རྟོགས། །
en: These the perfect buddhas behold and realize.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་མ་འོངས་པའི་དུས་ལ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་མཐོང་བ་ཆགས་པ་མེད་ཅིང་ཐོགས་པ་མེད་པ་འཇུག་གོ། །
en: (31) “Son of noble family, the tathāgatas’ vision of wisdom has unattached and unobstructed access to the future.

source: སེམས་ཅན་ནམ། ཆོས་སམ། ཞིང་གང་དག་ཁ་ཅིག་མ་འོངས་པའི་དུས་ན་འབྱུང་བའམ། འགག་པའམ། འབྱུང་བར་འགྱུར་བའམ། འཇིག་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The tathāgatas know each and every being, Dharma, and field that will arise and cease in the future, its arising and disappearance.

source: བསྐལ་པའི་མེས་ཚིག་པར་འགྱུར་བ་ཇི་སྙེད་པ་དང་། ཆུས་འཇིག་པར་འགྱུར་བ་ཇི་སྙེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གནས་པར་འགྱུར་བ་ཇི་སྙེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་སའི་ཁམས་སུ་འགྱུར་བ་ཇི་སྙེད་པ་དང་། རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་དུ་འགྱུར་བ་ཇི་སྙེད་པ་དང་། རྩྭ་དང་། ཤིང་གེལ་བ་དང་། སྨན་དང་། ནགས་ཚལ་དུ་འགྱུར་བ་ཇི་སྙེད་པ་དང་། སྐར་མའི་གཟུགས་སུ་འགྱུར་བ་ཇི་སྙེད་པ་དང་།
en: They know each and every destruction by fire or water of the eons to come, each and every buddhafield that will come into being, the total amount of earth in those buddhafields, each and every particle of dust, blade of grass, bush, herb, and forest, and each and every constellation of stars.

source: ཞིང་རབ་འབྱམ་རེ་རེར་སངས་རྒྱས་འབྱུང་བར་འགྱུར་བ་ཇི་སྙེད་པ་དང་། ཉན་ཐོས་འབྱུང་བར་འགྱུར་བ་ཇི་སྙེད་པ་དང་། རང་སངས་རྒྱས་འབྱུང་བར་འགྱུར་བ་ཇི་སྙེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་འབྱུང་བར་འགྱུར་བ་ཇི་སྙེད་པ་དང་། ཟས་ཀྱི་མཆོག་གི་ལོངས་སྤྱོད་དང་། དབུགས་འབྱུང་བ་དང་། རྔུབ་པ་དང་། འཆག་པ་དང་། འདུག་པ་དང་། སྤྱོད་ལམ་དུ་འགྱུར་བ་ཇི་སྙེད་པ་དང་།
en: “They know each and every buddha that will appear in each of those infinite buddhafields, each and every śrāvaka, pratyekabuddha, and bodhisattva, each and every enjoyment of excellent food, and each and every instance of inhalation, exhalation, walking, sitting, and conduct.

source: དེ་བཞིན་གཤེགས་པ་རབ་འབྱམ་རེ་རེས་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། ཐེག་པ་ཆེན་པོས་སེམས་ཅན་ཐར་བར་བྱེད་པར་འགྱུར་བ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The tathāgatas know each and every being in those infinite realms who will be liberated by means of the Śrāvaka Vehicle, the Pratyekabuddha Vehicle, and the Great Vehicle.

source: ཞིང་རབ་འབྱམ་རེ་རེ་ན་སེམས་ཅན་རྣམས་ཀྱི་སྐྱེ་བའི་གནས་ཇི་སྙེད་པ་དང་། སེམས་དང་སེམས་ལས་བྱུང་བ་ཇི་སྙེད་ཅིག་འབྱུང་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཀྱང་
en: They know the lifespan of each and every being in each of those infinite fields, as well as each and every mind and mental event to come.

source: དེ་བཞིན་གཤེགས་པའི་མ་འོངས་པའི་སེམས་ཀྱི་རྒྱུན་བསྐལ་པར་འགྱུར་བ་མ་ཡིན་པར་མ་འོངས་པ་ལ་ལྟ་བས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ།
en: Moreover, they teach the Dharma to beings while observing the future, without the future mindstream of tathāgatas being interrupted.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་སུམ་ཅུ་རྩ་གཅིག་པའོ། །
en: This is the thirty-first tathāgata activity of the tathāgatas.
